brunohorta82/BH-Boards/boards.txt
##############################################################
onofre.name=BH OnOfre
onofre.build.board=ESP8266_GENERIC
onofre.upload.tool=esptool
onofre.upload.maximum_data_size=81920
onofre.upload.wait_for_upload_port=true
onofre.upload.erase_cmd=
onofre.serial.disableDTR=true
onofre.serial.disableRTS=true
onofre.build.mcu=esp8266
onofre.build.core=esp8266
onofre.build.variant=generic
onofre.build.spiffs_pagesize=256
onofre.build.debug_port=
onofre.build.debug_level=
onofre.menu.CpuFrequency.80=80 MHz
onofre.menu.CpuFrequency.80.build.f_cpu=80000000L
onofre.menu.CpuFrequency.160=160 MHz
onofre.menu.CpuFrequency.160.build.f_cpu=160000000L
onofre.menu.VTable.flash=Flash
onofre.menu.VTable.flash.build.vtable_flags=-DVTABLES_IN_FLASH
onofre.menu.VTable.heap=Heap
onofre.menu.VTable.heap.build.vtable_flags=-DVTABLES_IN_DRAM
onofre.menu.VTable.iram=IRAM
onofre.menu.VTable.iram.build.vtable_flags=-DVTABLES_IN_IRAM
onofre.menu.ResetMethod.ck=ck
onofre.menu.ResetMethod.ck.upload.resetmethod=ck
onofre.menu.ResetMethod.nodemcu=nodemcu
onofre.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
onofre.menu.ResetMethod.none=none
onofre.menu.ResetMethod.none.upload.resetmethod=none
onofre.menu.ResetMethod.dtrset=dtrset
onofre.menu.ResetMethod.dtrset.upload.resetmethod=dtrset
onofre.menu.CrystalFreq.26=26 MHz
onofre.menu.CrystalFreq.40=40 MHz
onofre.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
onofre.menu.FlashFreq.40=40MHz
onofre.menu.FlashFreq.40.build.flash_freq=40
onofre.menu.FlashFreq.80=80MHz
onofre.menu.FlashFreq.80.build.flash_freq=80
onofre.menu.FlashMode.qio=QIO
onofre.menu.FlashMode.qio.build.flash_mode=qio
onofre.menu.FlashMode.qout=QOUT
onofre.menu.FlashMode.qout.build.flash_mode=qout
onofre.menu.FlashMode.dio=DIO
onofre.menu.FlashMode.dio.build.flash_mode=dio
onofre.menu.FlashMode.dout=DOUT
onofre.menu.FlashMode.dout.build.flash_mode=dout
onofre.menu.FlashSize.4M1M=4M (1M SPIFFS)
onofre.menu.FlashSize.4M1M.build.flash_size=4M
onofre.menu.FlashSize.4M1M.build.flash_size_bytes=0x400000
onofre.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
onofre.menu.FlashSize.4M1M.build.spiffs_pagesize=256
onofre.menu.FlashSize.4M1M.upload.maximum_size=1044464
onofre.menu.FlashSize.4M1M.build.rfcal_addr=0x3FC000
onofre.menu.FlashSize.4M1M.build.spiffs_start=0x300000
onofre.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
onofre.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
onofre.menu.FlashSize.4M2M=4M (2M SPIFFS)
onofre.menu.FlashSize.4M2M.build.flash_size=4M
onofre.menu.FlashSize.4M2M.build.flash_size_bytes=0x400000
onofre.menu.FlashSize.4M2M.build.flash_ld=eagle.flash.4m2m.ld
onofre.menu.FlashSize.4M2M.build.spiffs_pagesize=256
onofre.menu.FlashSize.4M2M.upload.maximum_size=1044464
onofre.menu.FlashSize.4M2M.build.rfcal_addr=0x3FC000
onofre.menu.FlashSize.4M2M.build.spiffs_start=0x200000
onofre.menu.FlashSize.4M2M.build.spiffs_end=0x3FB000
onofre.menu.FlashSize.4M2M.build.spiffs_blocksize=8192
onofre.menu.FlashSize.4M3M=4M (3M SPIFFS)
onofre.menu.FlashSize.4M3M.build.flash_size=4M
onofre.menu.FlashSize.4M3M.build.flash_size_bytes=0x400000
onofre.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
onofre.menu.FlashSize.4M3M.build.spiffs_pagesize=256
onofre.menu.FlashSize.4M3M.upload.maximum_size=1044464
onofre.menu.FlashSize.4M3M.build.rfcal_addr=0x3FC000
onofre.menu.FlashSize.4M3M.build.spiffs_start=0x100000
onofre.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
onofre.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
onofre.menu.LwIPVariant.v2mss536=v2 Lower Memory
onofre.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
onofre.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
onofre.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
onofre.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
onofre.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
onofre.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
onofre.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
onofre.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
onofre.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
onofre.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
onofre.menu.LwIPVariant.OpenSource=v1.4 Compile from source
onofre.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
onofre.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
onofre.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
onofre.menu.Debug.Disabled=Disabled
onofre.menu.Debug.Disabled.build.debug_port=
onofre.menu.Debug.Serial=Serial
onofre.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
onofre.menu.Debug.Serial1=Serial1
onofre.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
onofre.menu.DebugLevel.None____=None
onofre.menu.DebugLevel.None____.build.debug_level=
onofre.menu.DebugLevel.SSL=SSL
onofre.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
onofre.menu.DebugLevel.TLS_MEM=TLS_MEM
onofre.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
onofre.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
onofre.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
onofre.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
onofre.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
onofre.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
onofre.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
onofre.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
onofre.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
onofre.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
onofre.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
onofre.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
onofre.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
onofre.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
onofre.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
onofre.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
onofre.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
onofre.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
onofre.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
onofre.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
onofre.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
onofre.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
onofre.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
onofre.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
onofre.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
onofre.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
onofre.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
onofre.menu.DebugLevel.CORE=CORE
onofre.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
onofre.menu.DebugLevel.WIFI=WIFI
onofre.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
onofre.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
onofre.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
onofre.menu.DebugLevel.UPDATER=UPDATER
onofre.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
onofre.menu.DebugLevel.OTA=OTA
onofre.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
onofre.menu.DebugLevel.OOM=OOM
onofre.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM
onofre.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
onofre.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
onofre.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
onofre.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
onofre.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
onofre.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
onofre.menu.FlashErase.none=Only Sketch
onofre.menu.FlashErase.none.upload.erase_cmd=
onofre.menu.FlashErase.sdk=Sketch + WiFi Settings
onofre.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
onofre.menu.FlashErase.all=All Flash Contents
onofre.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
onofre.menu.UploadSpeed.921600=921600
onofre.menu.UploadSpeed.921600.upload.speed=921600
onofre.menu.UploadSpeed.115200=115200
onofre.menu.UploadSpeed.115200.upload.speed=115200
onofre.menu.UploadSpeed.9600=9600
onofre.menu.UploadSpeed.9600.upload.speed=9600
onofre.menu.UploadSpeed.57600=57600
onofre.menu.UploadSpeed.57600.upload.speed=57600
onofre.menu.UploadSpeed.230400.linux=230400
onofre.menu.UploadSpeed.230400.macosx=230400
onofre.menu.UploadSpeed.230400.upload.speed=230400
onofre.menu.UploadSpeed.256000.windows=256000
onofre.menu.UploadSpeed.256000.upload.speed=256000
onofre.menu.UploadSpeed.460800.linux=460800
onofre.menu.UploadSpeed.460800.macosx=460800
onofre.menu.UploadSpeed.460800.upload.speed=460800
onofre.menu.UploadSpeed.512000.windows=512000
onofre.menu.UploadSpeed.512000.upload.speed=512000

