brunohorta82/BH-Boards/boards.txt
##############################################################
bhpzem.name=BH Pzem
bhpzem.build.board=ESP8266_GENERIC
bhpzem.upload.tool=esptool
bhpzem.upload.maximum_data_size=81920
bhpzem.upload.wait_for_upload_port=true
bhpzem.upload.erase_cmd=
bhpzem.serial.disableDTR=true
bhpzem.serial.disableRTS=true
bhpzem.build.mcu=esp8266
bhpzem.build.core=esp8266
bhpzem.build.variant=generic
bhpzem.build.spiffs_pagesize=256
bhpzem.build.debug_port=
bhpzem.build.debug_level=
bhpzem.menu.CpuFrequency.80=80 MHz
bhpzem.menu.CpuFrequency.80.build.f_cpu=80000000L
bhpzem.menu.CpuFrequency.160=160 MHz
bhpzem.menu.CpuFrequency.160.build.f_cpu=160000000L
bhpzem.menu.VTable.flash=Flash
bhpzem.menu.VTable.flash.build.vtable_flags=-DVTABLES_IN_FLASH
bhpzem.menu.VTable.heap=Heap
bhpzem.menu.VTable.heap.build.vtable_flags=-DVTABLES_IN_DRAM
bhpzem.menu.VTable.iram=IRAM
bhpzem.menu.VTable.iram.build.vtable_flags=-DVTABLES_IN_IRAM
bhpzem.menu.ResetMethod.ck=ck
bhpzem.menu.ResetMethod.ck.upload.resetmethod=ck
bhpzem.menu.ResetMethod.nodemcu=nodemcu
bhpzem.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
bhpzem.menu.ResetMethod.none=none
bhpzem.menu.ResetMethod.none.upload.resetmethod=none
bhpzem.menu.ResetMethod.dtrset=dtrset
bhpzem.menu.ResetMethod.dtrset.upload.resetmethod=dtrset
bhpzem.menu.CrystalFreq.26=26 MHz
bhpzem.menu.CrystalFreq.40=40 MHz
bhpzem.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
bhpzem.menu.FlashFreq.40=40MHz
bhpzem.menu.FlashFreq.40.build.flash_freq=40
bhpzem.menu.FlashFreq.80=80MHz
bhpzem.menu.FlashFreq.80.build.flash_freq=80
bhpzem.menu.FlashMode.qio=QIO
bhpzem.menu.FlashMode.qio.build.flash_mode=qio
bhpzem.menu.FlashMode.qout=QOUT
bhpzem.menu.FlashMode.qout.build.flash_mode=qout
bhpzem.menu.FlashMode.dio=DIO
bhpzem.menu.FlashMode.dio.build.flash_mode=dio
bhpzem.menu.FlashMode.dout=DOUT
bhpzem.menu.FlashMode.dout.build.flash_mode=dout
bhpzem.menu.FlashSize.4M1M=4M (1M SPIFFS)
bhpzem.menu.FlashSize.4M1M.build.flash_size=4M
bhpzem.menu.FlashSize.4M1M.build.flash_size_bytes=0x400000
bhpzem.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
bhpzem.menu.FlashSize.4M1M.build.spiffs_pagesize=256
bhpzem.menu.FlashSize.4M1M.upload.maximum_size=1044464
bhpzem.menu.FlashSize.4M1M.build.rfcal_addr=0x3FC000
bhpzem.menu.FlashSize.4M1M.build.spiffs_start=0x300000
bhpzem.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
bhpzem.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
bhpzem.menu.FlashSize.4M2M=4M (2M SPIFFS)
bhpzem.menu.FlashSize.4M2M.build.flash_size=4M
bhpzem.menu.FlashSize.4M2M.build.flash_size_bytes=0x400000
bhpzem.menu.FlashSize.4M2M.build.flash_ld=eagle.flash.4m2m.ld
bhpzem.menu.FlashSize.4M2M.build.spiffs_pagesize=256
bhpzem.menu.FlashSize.4M2M.upload.maximum_size=1044464
bhpzem.menu.FlashSize.4M2M.build.rfcal_addr=0x3FC000
bhpzem.menu.FlashSize.4M2M.build.spiffs_start=0x200000
bhpzem.menu.FlashSize.4M2M.build.spiffs_end=0x3FB000
bhpzem.menu.FlashSize.4M2M.build.spiffs_blocksize=8192
bhpzem.menu.FlashSize.4M3M=4M (3M SPIFFS)
bhpzem.menu.FlashSize.4M3M.build.flash_size=4M
bhpzem.menu.FlashSize.4M3M.build.flash_size_bytes=0x400000
bhpzem.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
bhpzem.menu.FlashSize.4M3M.build.spiffs_pagesize=256
bhpzem.menu.FlashSize.4M3M.upload.maximum_size=1044464
bhpzem.menu.FlashSize.4M3M.build.rfcal_addr=0x3FC000
bhpzem.menu.FlashSize.4M3M.build.spiffs_start=0x100000
bhpzem.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
bhpzem.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
bhpzem.menu.LwIPVariant.v2mss536=v2 Lower Memory
bhpzem.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
bhpzem.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
bhpzem.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
bhpzem.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
bhpzem.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
bhpzem.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
bhpzem.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
bhpzem.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
bhpzem.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
bhpzem.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
bhpzem.menu.LwIPVariant.OpenSource=v1.4 Compile from source
bhpzem.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
bhpzem.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
bhpzem.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
bhpzem.menu.Debug.Disabled=Disabled
bhpzem.menu.Debug.Disabled.build.debug_port=
bhpzem.menu.Debug.Serial=Serial
bhpzem.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
bhpzem.menu.Debug.Serial1=Serial1
bhpzem.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
bhpzem.menu.DebugLevel.None____=None
bhpzem.menu.DebugLevel.None____.build.debug_level=
bhpzem.menu.DebugLevel.SSL=SSL
bhpzem.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
bhpzem.menu.DebugLevel.TLS_MEM=TLS_MEM
bhpzem.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
bhpzem.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
bhpzem.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
bhpzem.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
bhpzem.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
bhpzem.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
bhpzem.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
bhpzem.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
bhpzem.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
bhpzem.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
bhpzem.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
bhpzem.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
bhpzem.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
bhpzem.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
bhpzem.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
bhpzem.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
bhpzem.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
bhpzem.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
bhpzem.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
bhpzem.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
bhpzem.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
bhpzem.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
bhpzem.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
bhpzem.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
bhpzem.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
bhpzem.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
bhpzem.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
bhpzem.menu.DebugLevel.CORE=CORE
bhpzem.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
bhpzem.menu.DebugLevel.WIFI=WIFI
bhpzem.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
bhpzem.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
bhpzem.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
bhpzem.menu.DebugLevel.UPDATER=UPDATER
bhpzem.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
bhpzem.menu.DebugLevel.OTA=OTA
bhpzem.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
bhpzem.menu.DebugLevel.OOM=OOM
bhpzem.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM
bhpzem.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
bhpzem.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
bhpzem.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
bhpzem.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
bhpzem.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
bhpzem.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
bhpzem.menu.FlashErase.none=Only Sketch
bhpzem.menu.FlashErase.none.upload.erase_cmd=
bhpzem.menu.FlashErase.sdk=Sketch + WiFi Settings
bhpzem.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
bhpzem.menu.FlashErase.all=All Flash Contents
bhpzem.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
bhpzem.menu.UploadSpeed.921600=921600
bhpzem.menu.UploadSpeed.921600.upload.speed=921600
bhpzem.menu.UploadSpeed.115200=115200
bhpzem.menu.UploadSpeed.115200.upload.speed=115200
bhpzem.menu.UploadSpeed.9600=9600
bhpzem.menu.UploadSpeed.9600.upload.speed=9600
bhpzem.menu.UploadSpeed.57600=57600
bhpzem.menu.UploadSpeed.57600.upload.speed=57600
bhpzem.menu.UploadSpeed.230400.linux=230400
bhpzem.menu.UploadSpeed.230400.macosx=230400
bhpzem.menu.UploadSpeed.230400.upload.speed=230400
bhpzem.menu.UploadSpeed.256000.windows=256000
bhpzem.menu.UploadSpeed.256000.upload.speed=256000
bhpzem.menu.UploadSpeed.460800.linux=460800
bhpzem.menu.UploadSpeed.460800.macosx=460800
bhpzem.menu.UploadSpeed.460800.upload.speed=460800
bhpzem.menu.UploadSpeed.512000.windows=512000
bhpzem.menu.UploadSpeed.512000.upload.speed=512000

